In [134]:
import requests
import urllib.request
import time
from bs4 import BeautifulSoup
import itertools
import pandas as pd
import datetime
from multiprocessing.dummy import Pool  # This is a thread-based Pool
from multiprocessing import cpu_count

# Students

In [149]:
files = ['students0.csv',
         'students1.csv',
         'students2.csv',
         'students3.csv',
         'students4.csv']
df_list = [pd.read_csv(file) for file in files]
df = pd.concat(df_list, axis = 0)
df = df.reset_index(drop=True)

In [150]:
df['student_id'] = [x.split('?id=')[1].split('">')[0] for x in df['Mathematician']]
df['student_name'] = [x.split(">")[2].split("<")[0] for x in df['Mathematician']]

In [151]:
df['student_school'] = [BeautifulSoup(x).text for x in df['School']]
df['student_year'] = [BeautifulSoup(x).text for x in df['Year']]
df['student_descendants'] = [BeautifulSoup(x).text for x in df['Descendants']]

In [152]:
df_students = df[['id','student_id','student_name','student_school','student_year','student_descendants']]

In [154]:
df_students.shape

(265688, 6)

In [153]:
df_students.head()

,id,student_id,student_name,student_school,student_year,student_descendants
0,233136,233138,"Mogstad, Magne",Universitetet i Oslo,2008,1
1,13670,106100,"Anagnostakis, Christopher",Yale University,1984,
2,13670,122878,"Britton, John",Yale University,1966,
3,13670,122880,"Slotsky, Alice",Yale University,1992,1
4,13670,122881,"Swerdlow, Noel",Yale University,1968,

# Advisors

In [156]:
df_advisors = pd.read_csv('mathematicians.csv')

In [157]:
df_advisors = df_advisors[['Mathematician', 'School', 'Year', 'id']]
df_advisors.rename({'Mathematician':'advisor_name',
                    'School':'advisor_school',
                    'Year':'advisor_year'},
                  axis=1,
                  inplace=True)

# Merged

In [158]:
df_final = df_students.merge(df_advisors, on = 'id', how = 'left')

In [159]:
df_final.head()

,id,student_id,student_name,student_school,student_year,student_descendants,advisor_name,advisor_school,advisor_year
0,233136,233138,"Mogstad, Magne",Universitetet i Oslo,2008,1,"Aaberge, Rolf",Universitetet i Oslo,1976
1,13670,106100,"Anagnostakis, Christopher",Yale University,1984,,"Aaboe, Asger",Brown University,1957
2,13670,122878,"Britton, John",Yale University,1966,,"Aaboe, Asger",Brown University,1957
3,13670,122880,"Slotsky, Alice",Yale University,1992,1,"Aaboe, Asger",Brown University,1957
4,13670,122881,"Swerdlow, Noel",Yale University,1968,,"Aaboe, Asger",Brown University,1957

In [160]:
df_final.to_csv('math_geneology_final.csv')

In [170]:
df_final.query('student_id == "147102"')

,id,student_id,student_name,student_school,student_year,student_descendants,advisor_name,advisor_school,advisor_year
67039,34465,147102,"Lu, Ying",The University of North Carolina at Chapel Hill,2009,,"Fan, Jianqing","University of California, Berkeley",1989

In [175]:
print(len(df_final['id'].unique()))
print(len(df_final['student_id'].unique()))

59792
222799